//TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const a = 10;
// if (a === 10) {
//   console.log("вірно");
// } else {
//   console.log("Невірно");
// }
//TODO: № 2 на тернарник =============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно' через тернарник

// const a = 0;
// console.log(a === 10 ? "вірно" : "Невірно");

//TODO: № 3 на if...else if ===============================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// const min = -1;
// if (min >= 0 && min <= 15) {
//   console.log("Перша чверть");
// } else if (min > 15 && min <= 30) {
//   console.log("Друга чверть");
// } else if (min > 30 && min <= 45) {
//   console.log("Третя чверть");
// } else if (min > 45 && min <= 59) {
//   console.log("Четверта чверть");
// } else {
//   console.log("Ти не втому всесвіті");
// }
